<a href="https://colab.research.google.com/github/umsi-data-science/si370/blob/master/370_Pandas_I.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame({"a": [1,2,3],
                   "b": [4,5,6],
                   "c": [7,8,9]})

In [4]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [5]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [6]:
df.a

0    1
1    2
2    3
Name: a, dtype: int64

In [7]:
df.a.values

array([1, 2, 3])

In [8]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
df + 1

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10

In [10]:
df.a + 1

0    2
1    3
2    4
Name: a, dtype: int64

In [0]:
df['d'] = df['a'] + 1

In [12]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4

In [13]:
df.describe()

         a    b    c    d
count  3.0  3.0  3.0  3.0
mean   2.0  5.0  8.0  3.0
std    1.0  1.0  1.0  1.0
min    1.0  4.0  7.0  2.0
25%    1.5  4.5  7.5  2.5
50%    2.0  5.0  8.0  3.0
75%    2.5  5.5  8.5  3.5
max    3.0  6.0  9.0  4.0

In [14]:
df.apply(np.mean,axis=0)

a    2.0
b    5.0
c    8.0
d    3.0
dtype: float64

In [15]:
 df.apply(np.mean,axis=1)

0    3.5
1    4.5
2    5.5
dtype: float64

In [0]:
df['e'] = ["one","two","three"]
df['f'] = [1.0,5.0,9.0]

In [17]:
df

   a  b  c  d      e    f
0  1  4  7  2    one  1.0
1  2  5  8  3    two  5.0
2  3  6  9  4  three  9.0

In [18]:
df.dtypes

a      int64
b      int64
c      int64
d      int64
e     object
f    float64
dtype: object

In [19]:
df.select_dtypes(include=['int','float'])

   a  b  c  d    f
0  1  4  7  2  1.0
1  2  5  8  3  5.0
2  3  6  9  4  9.0

## Exercise X
Use .describe() to gather descriptive statistics on all the columns in the df DataFrame

In [20]:
# Solution
df.describe(include='all')

          a    b    c    d      e    f
count   3.0  3.0  3.0  3.0      3  3.0
unique  NaN  NaN  NaN  NaN      3  NaN
top     NaN  NaN  NaN  NaN  three  NaN
freq    NaN  NaN  NaN  NaN      1  NaN
mean    2.0  5.0  8.0  3.0    NaN  5.0
std     1.0  1.0  1.0  1.0    NaN  4.0
min     1.0  4.0  7.0  2.0    NaN  1.0
25%     1.5  4.5  7.5  2.5    NaN  3.0
50%     2.0  5.0  8.0  3.0    NaN  5.0
75%     2.5  5.5  8.5  3.5    NaN  7.0
max     3.0  6.0  9.0  4.0    NaN  9.0

In [0]:
df_missing = pd.DataFrame(
    {'a':[1,2,3,np.NaN],
     'b':[2,3,np.NaN,5]})

In [22]:
df_missing

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN
3  NaN  5.0

In [23]:
df_missing.dropna()

     a    b
0  1.0  2.0
1  2.0  3.0

In [24]:
df_missing.dropna(subset=['a'])

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN

In [25]:
df_missing.fillna(0)

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  0.0
3  0.0  5.0

In [26]:
df_missing.fillna(df.mean())

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  5.0
3  2.0  5.0

In [27]:
df_missing.fillna(method='ffill')

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  3.0
3  3.0  5.0

In [28]:
df_missing.fillna(method='bfill')

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  5.0
3  NaN  5.0

In [0]:
# from https://www.kaggle.com/austinreese/craigslist-carstrucks-data
# 5000 row sample

In [0]:
vehicles = pd.read_csv('https://raw.githubusercontent.com/umsi-data-science/si370/master/data/craigslist_vehicles_sample.csv')

In [32]:
vehicles.head()

   Unnamed: 0          id  ...      lat      long
0       27187  7089214269  ...  33.6372  -96.6184
1      421279  7077070594  ...  33.7792  -84.4118
2      111869  7093288110  ...  33.5375 -112.1590
3      342219  7089016788  ...  42.3042  -83.7068
4      461726  7091959768  ...  34.2548  -77.8456

[5 rows x 26 columns]

## Exercise:
The "year" column doesn't look right: the values are floats but they should be integers.  Use the "astype()" function to cast the values to 32-bit integers.  You might be tempted to do something like the following, which will result in an error.  Fix the error.

In [57]:
vehicles['year'] = vehicles['year'].astype('int32')

ValueError: ignored

In [0]:
# Solution
vehicles['year'] = vehicles.year.fillna(0).astype('int32')

## Exercise:

What proportion of listings were from the Ann Arbor region?

In [36]:
# Solution
len(vehicles[vehicles['region'] == 'ann arbor'])/len(vehicles)

0.0028

## Exercise:
List the top 3 manufacturers (note: when we say "top N", we typically mean the top N ranked from most common to least common).

In [59]:
# Solution
vehicles.manufacturer.value_counts()

ford               941
chevrolet          702
toyota             377
nissan             291
honda              248
jeep               242
ram                241
gmc                218
dodge              189
bmw                160
subaru             110
hyundai            107
volkswagen          94
mercedes-benz       94
kia                 92
chrysler            72
cadillac            68
lexus               63
buick               60
mazda               55
audi                52
infiniti            47
acura               36
pontiac             33
volvo               33
lincoln             31
mitsubishi          31
mercury             23
rover               16
mini                16
saturn              12
fiat                11
jaguar               6
harley-davidson      2
tesla                2
datsun               1
ferrari              1
Name: manufacturer, dtype: int64

In [54]:
vehicles.year.fillna(0).astype('int64')

0       1972
1       2009
2       2003
3       2018
4       2015
        ...
4995    2015
4996    2015
4997    2011
4998    2003
4999       0
Name: year, Length: 5000, dtype: int64